{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "batch_input_shape": [null, 3, 32, 32], "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "activation": "relu", "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_21", "filters": 64, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_23", "scale": true, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.3, "name": "dropout_17", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_22", "filters": 64, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_24", "scale": true, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_9", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_23", "filters": 128, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_25", "scale": true, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_18", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_24", "filters": 128, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_26", "scale": true, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_10", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_25", "filters": 256, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_27", "scale": true, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_19", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_26", "filters": 256, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_28", "scale": true, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_20", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_27", "filters": 256, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_29", "scale": true, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_11", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_28", "filters": 512, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_30", "scale": true, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_21", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_29", "filters": 512, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_31", "scale": true, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_22", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_30", "filters": 512, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_32", "scale": true, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_12", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_23", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "use_bias": true, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "units": 512, "kernel_constraint": null, "name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_33", "scale": true, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_24", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "units": 100, "kernel_constraint": null, "name": "dense_6", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow"}