{"config": [{"config": {"kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "filters": 32, "activity_regularizer": null, "name": "conv2d_19", "batch_input_shape": [null, 3, 32, 32], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "dtype": "float32", "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_first"}, "class_name": "Conv2D"}, {"config": {"rate": 0.2, "name": "dropout_19", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "filters": 32, "activity_regularizer": null, "name": "conv2d_20", "data_format": "channels_first", "padding": "same", "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_10", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true, "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "filters": 64, "activity_regularizer": null, "name": "conv2d_21", "data_format": "channels_first", "padding": "same", "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"rate": 0.2, "name": "dropout_20", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "filters": 64, "activity_regularizer": null, "name": "conv2d_22", "data_format": "channels_first", "padding": "same", "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_11", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true, "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "filters": 128, "activity_regularizer": null, "name": "conv2d_23", "data_format": "channels_first", "padding": "same", "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"rate": 0.2, "name": "dropout_21", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "filters": 128, "activity_regularizer": null, "name": "conv2d_24", "data_format": "channels_first", "padding": "same", "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_12", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true, "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_4", "trainable": true}, "class_name": "Flatten"}, {"config": {"rate": 0.2, "name": "dropout_22", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "units": 1024, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_10", "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.2, "name": "dropout_23", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "units": 512, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_11", "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.2, "name": "dropout_24", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "units": 10, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_12", "activation": "softmax", "trainable": true, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}